<header class="w-100 header">
  <div class="container">
    <div class="header-inner w-100 d-flex-rows">
      <a href="index.php" class="logo">
        <img src="media/logo/logo.svg" alt="gofit" />
      </a>

      <div class="hamb">
        <div class="hamb__field" id="hamb">
          <span class="bar"></span>
          <span class="bar"></span>
          <span class="bar"></span>
        </div>
      </div>

      <nav class="nav" id="nav">
        <a href="?page=home" class="nav_a"> Главная</a>
        <a href="?page=catalog" class="nav_a">Каталог</a>
        <a href="?page=about" class="nav_a"> О нас</a>

        <?php if (!is_null($user)) : ?>
          <a href="?page=profile">
            <img src="media/icons/profile.svg" alt="Профиль" />
            <p class="nav_a">Личный кабинет</p>
          </a>


          <?php if ($user['role_id'] === 2) : ?>
            <a href="?page=adminpanel">
              <svg width="30" height="30" viewBox="0 0 75 75" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M37.365 21.2501L42.93 15.6851L50.3902 8.2196C47.2937 7.89712 44.1659 8.36671 41.3006 9.5843C38.4353 10.8019 35.9263 12.7275 34.0091 15.1805C32.092 17.6335 30.8295 20.5334 30.3402 23.608C29.851 26.6827 30.1509 29.8312 31.212 32.7581L32.9235 37.4673L29.3797 41.0058L9.44546 60.9453C9.13142 61.2454 8.8805 61.6053 8.70746 62.0037C8.53442 62.4021 8.44274 62.8311 8.4378 63.2654C8.43287 63.6998 8.51478 64.1307 8.67873 64.533C8.84268 64.9352 9.08535 65.3007 9.3925 65.6078C9.69965 65.915 10.0651 66.1576 10.4673 66.3216C10.8696 66.4855 11.3005 66.5674 11.7349 66.5625C12.1692 66.5576 12.5982 66.4659 12.9966 66.2928C13.395 66.1198 13.7549 65.8689 14.055 65.5548L33.9945 45.6206L37.533 42.0769L42.2422 43.7831C45.1691 44.8441 48.3177 45.1441 51.3923 44.6548C54.4669 44.1656 57.3668 42.9031 59.8198 40.9859C62.2728 39.0688 64.1984 36.5598 65.416 33.6945C66.6336 30.8291 67.1032 27.7014 66.7807 24.6049L59.3152 32.0756L53.7502 37.6301L48.1852 32.0651L42.9352 26.8151L37.365 21.2501ZM69.7732 11.1176C73.0093 15.5938 74.7509 20.9767 74.7502 26.5001C74.7519 30.7176 73.7373 34.8734 71.7924 38.6156C69.8475 42.3579 67.0295 45.5765 63.577 47.9988C60.1246 50.4211 56.1393 51.9759 51.9586 52.5316C47.7778 53.0872 43.5248 52.6273 39.5595 51.1908L19.6252 71.1251C18.5911 72.1593 17.3633 72.9796 16.0121 73.5393C14.6609 74.099 13.2127 74.387 11.7502 74.387C10.2877 74.387 8.83949 74.099 7.48829 73.5393C6.1371 72.9796 4.90937 72.1593 3.87521 71.1251C1.78663 69.0365 0.613281 66.2038 0.613281 63.2501C0.613281 60.2964 1.78663 57.4637 3.87521 55.3751L23.8095 35.4409C21.8811 30.1249 21.721 24.3283 23.353 18.914C24.9849 13.4997 28.3217 8.75714 32.8665 5.39229C37.4114 2.02745 42.9214 0.220231 48.5763 0.239657C54.2311 0.259083 59.7286 2.10411 64.2502 5.5001L58.6012 11.1491L54.0705 15.6799L48.5002 21.2501L53.7502 26.5001L59.3152 20.9351L63.8512 16.3991L69.5002 10.7501L69.7732 11.1176Z" fill="black" />
              </svg>
              <p class="nav_a">Панель администратора</p>
            </a>
          <?php endif; ?>
        <?php endif; ?>

        <?php if (is_null($user)) : ?>
          <a href="?page=login">
            <img src="media/icons/profile.svg" alt="Авторизация" />
            <p class="nav_a">Авторизация</p>
          </a>
        <?php endif; ?>



        <a href="?page=shop">
          <img src="media/icons/shop.svg" alt="Корзина" />
          <p class="nav_a">Корзина</p>
        </a>
        <a href="?page=favourites">
          <img src="media/icons/fav_black.svg" alt="Избранное" />
          <p class="nav_a">Избранное</p>
        </a>
        <a href="?page=comparison">
          <img src="media/icons/weight.svg" class="scales" alt="Сравнение товаров" />
          <p class="nav_a">Сравнение товаров</p>
        </a>
      </nav>
    </div>
    <div class="popup" id="popup"></div>
  </div>
</header>



<script src="script/burger.js"></script>