<?php 

global $database;

$sql = "SELECT * FROM `product`
LIMIT 0,3";
$query = $database->query($sql);
$products = $query->fetchAll(2);

?>

<div class="intro w-100">
  <div class="container">
    <div class="intro-inner w-100 d-flex-columns">
      <h2>Будь в форме вместе с</h2>
      <a href="?page=catalog" class="btn"><span>Перейти в каталог</span></a>
    </div>
  </div>
</div>

<div class="collections w-100">
  <div class="container">
    <div class="collections-inner w-100 d-flex-columns">
      <h2>НОВЫЕ КОЛЛЕКЦИИ</h2>

      <div class="collections-cards d-flex-rows">
        <div class="collec-card">
          <img src="media/home/new_collections/1.png" alt="Nike Tech Collection" />
          <div class="collec-info d-flex-rows">
            <p>Nike Tech Collection</p>
            <svg width="27" height="28" viewBox="0 0 27 28" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M20.432 15.75L0.889808 15.75V12.25L20.432 12.25L11.8201 2.86305L14.0903 0.38855L26.5779 14L14.0903 27.6115L11.8201 25.1371L20.432 15.75Z" fill="white" />
            </svg>
          </div>
        </div>
        <div class="collec-card">
          <img src="media/home/new_collections/2.png" alt="Nike SK collection" />
          <div class="collec-info d-flex-rows">
            <p>Nike SK</p>
            <svg width="27" height="28" viewBox="0 0 27 28" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M20.432 15.75L0.889808 15.75V12.25L20.432 12.25L11.8201 2.86305L14.0903 0.38855L26.5779 14L14.0903 27.6115L11.8201 25.1371L20.432 15.75Z" fill="white" />
            </svg>
          </div>
        </div>
        <div class="collec-card">
          <img src="media/home/new_collections/3.png" alt="Reebok fitness collection" />
          <div class="collec-info d-flex-rows">
            <p>Reebok fitness</p>
            <svg width="27" height="28" viewBox="0 0 27 28" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M20.432 15.75L0.889808 15.75V12.25L20.432 12.25L11.8201 2.86305L14.0903 0.38855L26.5779 14L14.0903 27.6115L11.8201 25.1371L20.432 15.75Z" fill="white" />
            </svg>
          </div>
        </div>
      </div>
    </div>
  </div>
</div>

<div class="bestsellers w-100">
  <div class="container">
    <div class="bestsellers-inner w-100 d-flex-columns">
      <h2>БЕСТСЕЛЛЕРЫ</h2>

      <div class="bestsellers-items w-100 d-flex-rows">
        <?php foreach ($products as $product ) {
            $product = getProductById((int)$product['id']);
        ?>

          <div class="catalog-item d-flex-columns">
            <img src="<?= $product['image'] ?>" alt="<?= $product['name'] ?>">
            <?php if(isset($user)) : ?>
            <div class="btns">
            <form action="actions/user/likeProduct.php" method="post">
            <input type="text" name="page" value="<?="home"?>" style="display:none;">
            <input type="hidden" name="user_id" value="<?=$user['id']?>">
            <input type="hidden" name="product_id" value="<?=$product['id']?>">
              <button type="submit" class="like"><img src="media/icons/fav_black.svg" alt="Избранное"></button>
            </form>
            <form action="actions/user/compareProduct.php" method="post">
            <input type="text" name="page" value="<?="home"?>" style="display:none;">
            <input type="hidden" name="user_id" value="<?=$user['id']?>">
            <input type="hidden" name="product_id" value="<?=$product['id']?>">
            <button class="scale"><img src="media/icons/weight.svg" alt="Сравнение товаров"></button>
            </form>
            </div>
            <?php endif ?>
            <p class="category"><?= $product['type'] ?></p>
            <p class="price"><?=number_format($product['price'], '0', '.', ' ')?> ₽</p>
            <p class="descr"><?= $product['name'] ?></p>
            <a href="?page=more&id=<?= $product['id'] ?>" class="btn">Подробнее</a>
          </div>
        <?php } ?>

      </div>
    </div>
  </div>
</div>

<div class="subscribe w-100">
  <div class="container">
    <div class="subscribe-inner w-100 d-flex-rows">
      <div class="subs-info d-flex-columns">
        <h2>СКИДКА 10%</h2>
        <p>При подписке на рассылку</p>
        <form action="#" class="d-flex-columns">
          <input type="text" placeholder="Имя" />
          <input type="text" placeholder="Электронная почта" />
          <button type="submit">Подписаться</button>
          <div class="agree d-flex-rows">
            <input type="checkbox" />
            <p>
              Нажимая на кнопку я подтверждаю согласие на получение рассылки
              и обработку персональных данных
            </p>
          </div>
        </form>
      </div>

      <img src="media/home/subscribe/1.png" alt="Изображение для баннера с подпиской" />
    </div>
  </div>
</div>

<div class="gallery w-100">
  <div class="container">
    <div class="gallery-inner w-100 d-flex-rows">
      <img src="media/home/gallery/1.png" alt="Галерея фотографий" />
      <img src="media/home/gallery/2.png" alt="Галерея фотографий" />
      <img src="media/home/gallery/3.png" alt="Галерея фотографий" />
    </div>
  </div>
</div>

<div class="features w-100">
  <div class="container">
    <div class="features-inner w-100 d-flex-columns">
      <h2>GO FIT -</h2>
      <p>
        Это онлайн-магазин качественной <br />
        спортивной одежды от проверенных брендов.
      </p>

      <div class="features-items w-100 d-flex-rows">
        <div class="features-item d-flex-columns">
          <svg width="111" height="111" viewBox="0 0 111 111" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M23.4167 78.4167C23.4167 80.8478 24.3825 83.1794 26.1016 84.8985C27.8207 86.6176 30.1523 87.5833 32.5834 87.5833C35.0146 87.5833 37.3461 86.6176 39.0652 84.8985C40.7843 83.1794 41.7501 80.8478 41.7501 78.4167C41.7501 75.9855 40.7843 73.6539 39.0652 71.9349C37.3461 70.2158 35.0146 69.25 32.5834 69.25C30.1523 69.25 27.8207 70.2158 26.1016 71.9349C24.3825 73.6539 23.4167 75.9855 23.4167 78.4167ZM69.2501 78.4167C69.2501 80.8478 70.2159 83.1794 71.9349 84.8985C73.654 86.6176 75.9856 87.5833 78.4167 87.5833C80.8479 87.5833 83.1795 86.6176 84.8986 84.8985C86.6176 83.1794 87.5834 80.8478 87.5834 78.4167C87.5834 75.9855 86.6176 73.6539 84.8986 71.9349C83.1795 70.2158 80.8479 69.25 78.4167 69.25C75.9856 69.25 73.654 70.2158 71.9349 71.9349C70.2159 73.6539 69.2501 75.9855 69.2501 78.4167Z" stroke="white" stroke-width="9.16667" stroke-linecap="round" stroke-linejoin="round" />
            <path d="M23.4167 78.4166H14.2501V60.0833M9.66675 23.4166H60.0834V78.4166M41.7501 78.4166H69.2501M87.5834 78.4166H96.7501V50.9166M96.7501 50.9166H60.0834M96.7501 50.9166L83.0001 28H60.0834M14.2501 41.75H32.5834" stroke="white" stroke-width="9.16667" stroke-linecap="round" stroke-linejoin="round" />
          </svg>

          <p>Быстрая <br> доставка</p>
        </div>
        <div class="features-item d-flex-columns">
          <svg width="111" height="111" viewBox="0 0 111 111" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M52.5909 13.6862C51.9722 14.4012 51.1884 15.492 49.9876 17.1741L49.2955 18.1549C49.2405 18.2237 49.1901 18.3016 49.1351 18.3841C48.5576 19.2045 47.7509 20.3458 46.5363 21.0608C45.3218 21.7758 43.933 21.9224 42.9338 22.0233L42.6588 22.0554L41.4626 22.1929C40.0194 22.326 38.5821 22.5172 37.1543 22.7658C37.6538 23.5999 38.4605 24.7137 39.7209 26.4233L40.4359 27.4041L40.6055 27.6333C41.2151 28.4537 42.0401 29.5629 42.3472 30.9241C42.6588 32.2899 42.393 33.6512 42.1959 34.6458L42.1409 34.9208L41.9118 36.1033C41.5084 38.2208 41.2563 39.5729 41.1738 40.5308C42.1043 40.3291 43.3968 39.9166 45.4134 39.2566L46.5593 38.8854L46.8205 38.7983C47.7738 38.4774 49.0938 38.042 50.4963 38.1841C51.8851 38.3308 53.0905 39.0229 53.9751 39.5316L54.218 39.6691L55.2722 40.2649C57.078 41.2916 58.2651 41.9608 59.1405 42.3549C59.2138 41.4016 59.2047 40.0495 59.1818 37.9824L59.168 36.7724L59.1588 36.4929C59.1451 35.4799 59.1176 34.0866 59.6676 32.7987C60.2176 31.5016 61.2488 30.5574 61.9913 29.8791L62.193 29.6958L63.073 28.8754C64.6176 27.4454 65.603 26.5195 66.2309 25.8045C65.3463 25.4149 64.0355 24.9795 61.9868 24.3104L60.8409 23.9345C60.7509 23.9052 60.6607 23.8762 60.5705 23.8474C59.6034 23.5358 58.288 23.1141 57.2384 22.1837C56.198 21.2579 55.6205 19.9974 55.1988 19.067C55.1596 18.9828 55.1198 18.8988 55.0797 18.8149L54.5663 17.7149C53.9648 16.3449 53.3057 15.0007 52.5909 13.6862ZM60.103 42.7079C60.1076 42.7075 60.1122 42.7075 60.1168 42.7079H60.103ZM47.9618 8.56203C49.1076 7.38411 50.863 6.01828 53.3243 6.27036C55.7626 6.52703 57.2201 8.19536 58.1184 9.57036C58.9709 10.8674 59.8005 12.6595 60.7034 14.6074L60.8043 14.8229L61.3176 15.9229L61.6705 16.6791L61.8401 17.0183L62.1884 17.142L62.9722 17.4033L64.1226 17.7791L64.3518 17.8524C66.3776 18.517 68.2476 19.1266 69.6409 19.8233C71.1168 20.5566 72.9272 21.8079 73.468 24.1866C74.018 26.5837 72.9043 28.4949 71.873 29.7783C70.9105 30.9929 69.4713 32.322 67.9268 33.7566L67.748 33.9216L66.868 34.7374C66.5902 34.9973 66.3152 35.2601 66.043 35.5258C66.0338 35.6129 66.0338 35.7229 66.0338 35.8649L66.0384 36.6899L66.0568 37.9045V38.1429C66.0843 40.2787 66.1072 42.2495 65.9009 43.7849C65.6809 45.4029 65.0759 47.5616 62.9401 48.8174C60.8088 50.0687 58.6318 49.5508 57.1101 48.9595C55.6618 48.4004 53.9476 47.4241 52.0868 46.3699L51.8805 46.2508L50.8263 45.6549C50.483 45.4604 50.1377 45.2695 49.7905 45.082C49.4226 45.1927 49.056 45.3073 48.6905 45.4258L47.5447 45.797L47.3155 45.8704C45.3126 46.5258 43.4472 47.1354 41.9209 47.392C40.2938 47.667 38.0893 47.7129 36.2559 46.0812C34.4318 44.4587 34.2118 42.2679 34.2805 40.6224C34.3447 39.0687 34.7159 37.1391 35.1147 35.0491L35.1605 34.8154L35.3897 33.6283C35.4626 33.2379 35.5313 32.8514 35.5959 32.4595C35.3656 32.1301 35.1319 31.8032 34.8947 31.4787L34.1751 30.4979L34.0376 30.3054C32.7634 28.5774 31.5947 26.9824 30.8659 25.6074C30.0959 24.1637 29.3305 22.0783 30.2976 19.8187C31.2693 17.5362 33.3226 16.6654 34.9084 16.2437C36.4026 15.8449 38.3505 15.6249 40.4543 15.3912L40.6972 15.3637L41.8888 15.2262C42.2682 15.1843 42.6471 15.1385 43.0255 15.0887L43.2134 14.8366L43.6901 14.172L44.3868 13.1912L44.5288 12.9941C45.7526 11.2754 46.8893 9.67578 47.9663 8.56661M103.975 42.3183C104.202 42.7083 104.351 43.1393 104.412 43.5867C104.473 44.0342 104.445 44.4892 104.33 44.9259C104.215 45.3626 104.015 45.7724 103.742 46.1318C103.469 46.4913 103.127 46.7933 102.737 47.0208C76.5526 62.2833 70.0626 86.937 70.0626 101.333C70.0626 102.245 69.7004 103.119 69.0558 103.764C68.4111 104.409 67.5368 104.771 66.6251 104.771C65.7134 104.771 64.8391 104.409 64.1944 103.764C63.5498 103.119 63.1876 102.245 63.1876 101.333C63.1876 85.177 70.4476 57.8833 99.2676 41.0716C99.6576 40.844 100.089 40.6954 100.536 40.6344C100.983 40.5734 101.439 40.6012 101.875 40.7161C102.312 40.831 102.722 41.0309 103.081 41.3042C103.441 41.5775 103.743 41.919 103.97 42.3091M51.5276 52.1999C52.4039 52.4505 53.1449 53.0388 53.5875 53.8356C54.0301 54.6323 54.1382 55.5723 53.888 56.4487C52.2059 62.3291 51.8072 70.8587 52.073 79.402C52.3343 87.8629 53.2372 95.9754 53.9797 100.815C54.0619 101.267 54.0528 101.731 53.9528 102.179C53.8528 102.628 53.6639 103.052 53.3974 103.426C53.1308 103.8 52.792 104.117 52.4009 104.358C52.0099 104.599 51.5745 104.759 51.1204 104.829C50.6664 104.898 50.203 104.877 49.7576 104.764C49.3122 104.652 48.8938 104.452 48.5271 104.175C48.1605 103.898 47.853 103.551 47.6228 103.153C47.3927 102.756 47.2445 102.316 47.1872 101.86C46.1028 94.4898 45.4387 87.0635 45.198 79.6174C44.9276 70.9366 45.2897 61.5133 47.2788 54.5604C47.5294 53.684 48.1177 52.9431 48.9145 52.5005C49.7112 52.0578 50.6512 51.9497 51.5276 52.1999Z" fill="white" />
            <path d="M23.0835 61.3116C23.0835 61.3116 26.0627 64.7353 28.6889 65.4366C31.3152 66.147 35.6098 64.6666 35.6098 64.6666C35.6098 64.6666 32.1768 67.6458 31.4756 70.2674C30.7698 72.8937 32.2548 77.1883 32.2548 77.1883C32.2548 77.1883 29.2756 73.7599 26.6493 73.0541C24.0231 72.3528 19.7285 73.8333 19.7285 73.8333C19.7285 73.8333 23.1568 70.8541 23.8581 68.2278C24.5639 65.6016 23.0835 61.3116 23.0835 61.3116Z" stroke="white" stroke-width="4.58333" stroke-linejoin="round" />
          </svg>

          <p>Высокое <br> качество</p>
        </div>
        <div class="features-item d-flex-columns">
          <svg width="111" height="110" viewBox="0 0 111 110" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M5.41699 100.833L12.292 77.9166H44.3753L51.2503 100.833H5.41699ZM60.417 100.833L67.292 77.9166H99.3753L106.25 100.833H60.417ZM28.3337 68.75L35.2087 45.8333H67.292L74.167 68.75H28.3337ZM106.25 27.7291L88.5587 32.725L83.5628 50.4166L78.567 32.725L60.8753 27.7291L78.567 22.7333L83.5628 5.04163L88.5587 22.7333L106.25 27.7291Z" fill="white" />
          </svg>

          <p>Проверенные <br> бренды</p>
        </div>
        <div class="features-item d-flex-columns">
          <svg width="111" height="110" viewBox="0 0 111 110" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M55.5002 100.833L53.2085 55L37.1668 50.4167H5.0835V41.25H32.5835L64.6668 18.3334L70.6252 25.323L51.6043 38.9584H64.6668L100.417 18.3334L105.917 24.75L66.9585 55L64.6668 100.833H55.5002ZM28.0002 36.6667C25.4793 36.6667 23.3221 35.7699 21.5285 33.9763C19.7349 32.1827 18.8366 30.0239 18.8335 27.5C18.8335 24.9792 19.7318 22.822 21.5285 21.0284C23.3252 19.2348 25.4824 18.3364 28.0002 18.3334C30.521 18.3334 32.6797 19.2317 34.4764 21.0284C36.2731 22.825 37.1699 24.9823 37.1668 27.5C37.1668 30.0209 36.27 32.1796 34.4764 33.9763C32.6828 35.773 30.5241 36.6698 28.0002 36.6667Z" fill="white" />
          </svg>
          <p>Большой <br> ассортимент</p>
        </div>
      </div>
    </div>
  </div>
</div>